import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/ui/accordion";

const faqs = [
  {
    id: "1",
    title: "আপনাদের মধু কি ১০০% খাঁটি ও প্রাকৃতিক?",
    content:
      "জি হ্যাঁ! আমাদের মধু ১০০% খাঁটি, কাঁচা এবং এতে কোনো ধরনের কৃত্রিম উপাদান, চিনি বা সংরক্ষণকারী মেশানো হয় না।",
  },
  {
    id: "2",
    title: "আপনাদের মধু কোথা থেকে আসে?",
    content:
      "আমরা আমাদের মধু বিশ্বস্ত স্থানীয় মৌয়ালদের কাছ থেকে সংগ্রহ করি, যারা নৈতিক ও টেকসই মৌচাষ পদ্ধতি অনুসরণ করেন।",
  },
  {
    id: "3",
    title: "মধু কীভাবে সংরক্ষণ করব?",
    content:
      "মধু সবসময় ঢাকনাযুক্ত কাঁচের বোতলে রুম টেম্পারেচারে রাখুন এবং সরাসরি সূর্যালোক থেকে দূরে রাখুন। ফ্রিজে রাখার প্রয়োজন নেই।",
  },
  {
    id: "4",
    title: "আমার মধু জমে গেছে, এটা কি নষ্ট হয়ে গেছে?",
    content:
      "না, মধু জমে যাওয়া (ক্রিস্টালাইজেশন) একদম স্বাভাবিক এবং এটি খাঁটি মধুর লক্ষণ। বোতলকে হালকা গরম পানিতে রাখলে এটি আবার তরল হয়ে যাবে।",
  },
  {
    id: "5",
    title: "আপনারা কি বিভিন্ন ধরনের মধু বিক্রি করেন?",
    content:
      "জি হ্যাঁ, আমাদের কাছে রয়েছে বিভিন্ন স্বাদের মধু যেমন — বনফুল মধু, আকাশিয়া মধু, এবং মাল্টিফ্লোরা মধু। প্রতিটি প্রকারের স্বাদ ও উপকারিতা আলাদা।",
  },
  {
    id: "6",
    title: "মধু কি ত্বক ও চুলের যত্নে ব্যবহার করা যায়?",
    content:
      "অবশ্যই! মধুতে প্রাকৃতিক অ্যান্টিব্যাকটেরিয়াল এবং ময়েশ্চারাইজিং গুণ রয়েছে, যা ত্বক ও চুলের জন্য অত্যন্ত উপকারী।",
  },
  {
    id: "7",
    title: "আপনারা কি পাইকারি বা বড় পরিমাণে মধু বিক্রি করেন?",
    content:
      "জি হ্যাঁ, আমরা ব্যবসা, রেস্টুরেন্ট ও ইভেন্টের জন্য বড় পরিমাণে মধু সরবরাহ করি। বিশেষ দামের জন্য আমাদের সাথে যোগাযোগ করুন।",
  },
  {
    id: "8",
    title: "আপনাদের প্যাকেজিং কি পরিবেশবান্ধব?",
    content:
      "আমরা কাঁচের বোতল ও পুনর্ব্যবহারযোগ্য প্যাকেজিং ব্যবহার করি যাতে পরিবেশের ক্ষতি না হয়।",
  },
  {
    id: "9",
    title: "আপনারা কি সারা দেশে ডেলিভারি দেন?",
    content:
      "জি হ্যাঁ, আমরা সারা দেশে ডেলিভারি দিয়ে থাকি। ডেলিভারি চার্জ ও সময় লোকেশন অনুযায়ী ভিন্ন হতে পারে।",
  },
  {
    id: "10",
    title: "রিটার্ন বা রিফান্ড নীতিমালা কী?",
    content:
      "আপনার অর্ডার ক্ষতিগ্রস্ত বা ভুল হলে, ডেলিভারি পাওয়ার ৪৮ ঘণ্টার মধ্যে আমাদের সাথে যোগাযোগ করুন। আমরা রিপ্লেসমেন্ট বা রিফান্ডের ব্যবস্থা করব।",
  },
];
export default function FAQAccordion() {
  return (
    <div className="space-y-4 max-w-7xl mx-auto px-4 mb-12">
      <Accordion type="single" collapsible className="w-full " defaultValue="3">
        {faqs.map((item) => (
          <AccordionItem value={item.id} key={item.id} className="py-2 ">
            <AccordionTrigger className="py-2 text-[15px] cursor-pointer leading-6 hover:no-underline">
              <span className="text-lg font-medium">{item.title}</span>
            </AccordionTrigger>
            <AccordionContent className="text-muted-foreground pb-2">
              <span className="text-base">{item.content}</span>
            </AccordionContent>
          </AccordionItem>
        ))}
      </Accordion>
    </div>
  );
}
